app/controllers/api/v1/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @posts = @user.posts.includes(:comments)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3)  [["post_id", 9], ["post_id", 12], ["post_id", 15]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]