app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = current_user.comments.new(post_id: @post.id, user_id: current_user.id, Text: comment_params)
    @comment.post_id = @post.id

    return unless @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 164], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "user_id", "Text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 1], ["user_id", 1], ["Text", "working"], ["created_at", "2022-08-20 14:11:22.428201"], ["updated_at", "2022-08-20 14:11:22.428201"]]

  def destroy
    @comment = Comment.find(params[:comment_id])
    @post = Post.find(@comment.post_id)
    @post.commentscounter -= 1
    @comment.destroy!
    @post.save
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
UPDATE "posts" SET "commentscounter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["commentscounter", 0], ["updated_at", "2022-08-26 13:31:56.530729"], ["id", 9]]