app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @like = Like.new(user_id: current_user.id, post_id: @post.id)
    @like.user = current_user
    @like.post = Post.find(params[:post_id])
    @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "likescounter" = COALESCE("likescounter", 0) + $1 WHERE "posts"."id" = $2  [["likescounter", 1], ["id", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["created_at", "2022-08-20 09:37:41.863976"], ["updated_at", "2022-08-20 09:37:41.863976"]]