app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6) LIMIT $7  [["post_id", 1], ["post_id", 1], ["post_id", 1], ["post_id", 1], ["post_id", 1], ["post_id", 1], ["LIMIT", 1]]
SELECT "posts"."id" FROM "posts" LEFT OUTER JOIN "comments" ON "comments"."post_id" = "posts"."id" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @posts = @user.posts.includes(:comments)

INSERT INTO "posts" ("user_id", "title", "text", "commentscounter", "likescounter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = current_user.posts.new(post_params)
    @post.likescounter = 0
    @post.commentscounter = 0
    @post.update_post_counter

    respond_to do |format|
      format.html do
        if @post.save