app/models/comment.rb

UPDATE "posts" SET "commentscounter" = COALESCE("commentscounter", 0) + $1 WHERE "posts"."id" = $2  [["commentscounter", 1], ["id", 162]]
---
  def update_comment_counter
    post.increment!(:commentscounter)