app/models/like.rb

  def update_like_counter
    post.increment!(:likescounter)
---
UPDATE "posts" SET "likescounter" = COALESCE("likescounter", 0) + $1 WHERE "posts"."id" = $2  [["likescounter", 1], ["id", 162]]