app/models/post.rb

UPDATE "users" SET "postscounter" = COALESCE("postscounter", 0) + $1 WHERE "users"."id" = $2  [["postscounter", 1], ["id", 1]]
---
  def update_post_counter
    user.increment!(:postscounter)